Cylinder_snappyHexMesh_laminar/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

// Divisions in x/y/z directions. Can be unequal.
nx   20;
ny   20;
nz   200;


Xmin -11.1;
Xmax  11.1;
Ymin -11.1;
Ymax  11.1;
Zmin -1.1;
Zmax  201.1;

geometry
{
}

vertices
(
  ($Xmin  $Ymin  $Zmin) //0
  ($Xmax  $Ymin  $Zmin) //1
  ($Xmax  $Ymax  $Zmin) //2
  ($Xmin  $Ymax  $Zmin) //3
  ($Xmin  $Ymin  $Zmax) //4
  ($Xmax  $Ymin  $Zmax) //5
  ($Xmax  $Ymax  $Zmax) //6
  ($Xmin  $Ymax  $Zmax) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

edges
(
);

faces
(
);

boundary
(
);

// ************************************************************************* //
